Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/mlb.h
/* -------- MLB_MS0 : (MLB Offset: 0x40C) (R/W 32) MediaLB Channel Status 0 Register -------- */
#define MLB_MS0_RESETVALUE                    _UINT32_(0x00)                                       /*  (MLB_MS0) MediaLB Channel Status 0 Register  Reset Value */

#define MLB_MS0_MCS_Pos                       _UINT32_(0)                                          /* (MLB_MS0) MediaLB channel status (for channels 31 to 0) Position */
#define MLB_MS0_MCS_Msk                       (_UINT32_(0xFFFFFFFF) << MLB_MS0_MCS_Pos)            /* (MLB_MS0) MediaLB channel status (for channels 31 to 0) Mask */
#define MLB_MS0_MCS(value)                    (MLB_MS0_MCS_Msk & (_UINT32_(value) << MLB_MS0_MCS_Pos)) /* Assigment of value for MCS in the MLB_MS0 register */
#define MLB_MS0_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (MLB_MS0) Register Mask  */


/* -------- MLB_MS1 : (MLB Offset: 0x414) (R/W 32) MediaLB Channel Status 1 Register -------- */
#define MLB_MS1_RESETVALUE                    _UINT32_(0x00)                                       /*  (MLB_MS1) MediaLB Channel Status 1 Register  Reset Value */

#define MLB_MS1_MCS_Pos                       _UINT32_(0)                                          /* (MLB_MS1) MediaLB channel status (for channels 63 to 32) Position */
#define MLB_MS1_MCS_Msk                       (_UINT32_(0xFFFFFFFF) << MLB_MS1_MCS_Pos)            /* (MLB_MS1) MediaLB channel status (for channels 63 to 32) Mask */
#define MLB_MS1_MCS(value)                    (MLB_MS1_MCS_Msk & (_UINT32_(value) << MLB_MS1_MCS_Pos)) /* Assigment of value for MCS in the MLB_MS1 register */
#define MLB_MS1_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (MLB_MS1) Register Mask  */


/* -------- MLB_MSS : (MLB Offset: 0x420) (R/W 32) MediaLB System Status Register -------- */
#define MLB_MSS_RESETVALUE                    _UINT32_(0x00)                                       /*  (MLB_MSS) MediaLB System Status Register  Reset Value */

#define MLB_MSS_RSTSYSCMD_Pos                 _UINT32_(0)                                          /* (MLB_MSS) Reset system command detected Position */
#define MLB_MSS_RSTSYSCMD_Msk                 (_UINT32_(0x1) << MLB_MSS_RSTSYSCMD_Pos)             /* (MLB_MSS) Reset system command detected Mask */
#define MLB_MSS_RSTSYSCMD(value)              (MLB_MSS_RSTSYSCMD_Msk & (_UINT32_(value) << MLB_MSS_RSTSYSCMD_Pos)) /* Assigment of value for RSTSYSCMD in the MLB_MSS register */
#define MLB_MSS_LKSYSCMD_Pos                  _UINT32_(1)                                          /* (MLB_MSS) Network lock system command detected Position */
#define MLB_MSS_LKSYSCMD_Msk                  (_UINT32_(0x1) << MLB_MSS_LKSYSCMD_Pos)              /* (MLB_MSS) Network lock system command detected Mask */
#define MLB_MSS_LKSYSCMD(value)               (MLB_MSS_LKSYSCMD_Msk & (_UINT32_(value) << MLB_MSS_LKSYSCMD_Pos)) /* Assigment of value for LKSYSCMD in the MLB_MSS register */
#define MLB_MSS_ULKSYSCMD_Pos                 _UINT32_(2)                                          /* (MLB_MSS) Network unlock system command detected Position */
#define MLB_MSS_ULKSYSCMD_Msk                 (_UINT32_(0x1) << MLB_MSS_ULKSYSCMD_Pos)             /* (MLB_MSS) Network unlock system command detected Mask */
#define MLB_MSS_ULKSYSCMD(value)              (MLB_MSS_ULKSYSCMD_Msk & (_UINT32_(value) << MLB_MSS_ULKSYSCMD_Pos)) /* Assigment of value for ULKSYSCMD in the MLB_MSS register */
#define MLB_MSS_CSSYSCMD_Pos                  _UINT32_(3)                                          /* (MLB_MSS) Channel scan system command detected Position */
#define MLB_MSS_CSSYSCMD_Msk                  (_UINT32_(0x1) << MLB_MSS_CSSYSCMD_Pos)              /* (MLB_MSS) Channel scan system command detected Mask */
#define MLB_MSS_CSSYSCMD(value)               (MLB_MSS_CSSYSCMD_Msk & (_UINT32_(value) << MLB_MSS_CSSYSCMD_Pos)) /* Assigment of value for CSSYSCMD in the MLB_MSS register */
#define MLB_MSS_SWSYSCMD_Pos                  _UINT32_(4)                                          /* (MLB_MSS) Software system command detected Position */
#define MLB_MSS_SWSYSCMD_Msk                  (_UINT32_(0x1) << MLB_MSS_SWSYSCMD_Pos)              /* (MLB_MSS) Software system command detected Mask */
#define MLB_MSS_SWSYSCMD(value)               (MLB_MSS_SWSYSCMD_Msk & (_UINT32_(value) << MLB_MSS_SWSYSCMD_Pos)) /* Assigment of value for SWSYSCMD in the MLB_MSS register */
#define MLB_MSS_SERVREQ_Pos                   _UINT32_(5)                                          /* (MLB_MSS) Service request enable Position */
#define MLB_MSS_SERVREQ_Msk                   (_UINT32_(0x1) << MLB_MSS_SERVREQ_Pos)               /* (MLB_MSS) Service request enable Mask */
#define MLB_MSS_SERVREQ(value)                (MLB_MSS_SERVREQ_Msk & (_UINT32_(value) << MLB_MSS_SERVREQ_Pos)) /* Assigment of value for SERVREQ in the MLB_MSS register */
#define MLB_MSS_Msk                           _UINT32_(0x0000003F)                                 /* (MLB_MSS) Register Mask  */


/* -------- MLB_MSD : (MLB Offset: 0x424) ( R/ 32) MediaLB System Data Register (Read-only) -------- */
#define MLB_MSD_RESETVALUE                    _UINT32_(0x00)                                       /*  (MLB_MSD) MediaLB System Data Register (Read-only)  Reset Value */

#define MLB_MSD_SD0_Pos                       _UINT32_(0)                                          /* (MLB_MSD) System data (byte 0) - LSB Position */
#define MLB_MSD_SD0_Msk                       (_UINT32_(0xFF) << MLB_MSD_SD0_Pos)                  /* (MLB_MSD) System data (byte 0) - LSB Mask */
#define MLB_MSD_SD0(value)                    (MLB_MSD_SD0_Msk & (_UINT32_(value) << MLB_MSD_SD0_Pos)) /* Assigment of value for SD0 in the MLB_MSD register */
#define MLB_MSD_SD1_Pos                       _UINT32_(8)                                          /* (MLB_MSD) System data (byte 1) Position */
#define MLB_MSD_SD1_Msk                       (_UINT32_(0xFF) << MLB_MSD_SD1_Pos)                  /* (MLB_MSD) System data (byte 1) Mask */
#define MLB_MSD_SD1(value)                    (MLB_MSD_SD1_Msk & (_UINT32_(value) << MLB_MSD_SD1_Pos)) /* Assigment of value for SD1 in the MLB_MSD register */
#define MLB_MSD_SD2_Pos                       _UINT32_(16)                                         /* (MLB_MSD) System data (byte 2) Position */
#define MLB_MSD_SD2_Msk                       (_UINT32_(0xFF) << MLB_MSD_SD2_Pos)                  /* (MLB_MSD) System data (byte 2) Mask */
#define MLB_MSD_SD2(value)                    (MLB_MSD_SD2_Msk & (_UINT32_(value) << MLB_MSD_SD2_Pos)) /* Assigment of value for SD2 in the MLB_MSD register */
#define MLB_MSD_SD3_Pos                       _UINT32_(24)                                         /* (MLB_MSD) System data (byte 3) - MSB Position */
#define MLB_MSD_SD3_Msk                       (_UINT32_(0xFF) << MLB_MSD_SD3_Pos)                  /* (MLB_MSD) System data (byte 3) - MSB Mask */
#define MLB_MSD_SD3(value)                    (MLB_MSD_SD3_Msk & (_UINT32_(value) << MLB_MSD_SD3_Pos)) /* Assigment of value for SD3 in the MLB_MSD register */
#define MLB_MSD_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (MLB_MSD) Register Mask  */


/* -------- MLB_MIEN : (MLB Offset: 0x42C) (R/W 32) MediaLB Interrupt Enable Register -------- */
#define MLB_MIEN_RESETVALUE                   _UINT32_(0x00)                                       /*  (MLB_MIEN) MediaLB Interrupt Enable Register  Reset Value */

#define MLB_MIEN_ISOC_PE_Pos                  _UINT32_(0)                                          /* (MLB_MIEN) Isochronous Rx protocol error enable Position */
#define MLB_MIEN_ISOC_PE_Msk                  (_UINT32_(0x1) << MLB_MIEN_ISOC_PE_Pos)              /* (MLB_MIEN) Isochronous Rx protocol error enable Mask */
#define MLB_MIEN_ISOC_PE(value)               (MLB_MIEN_ISOC_PE_Msk & (_UINT32_(value) << MLB_MIEN_ISOC_PE_Pos)) /* Assigment of value for ISOC_PE in the MLB_MIEN register */
#define MLB_MIEN_ISOC_BUFO_Pos                _UINT32_(1)                                          /* (MLB_MIEN) Isochronous Rx buffer overflow enable Position */
#define MLB_MIEN_ISOC_BUFO_Msk                (_UINT32_(0x1) << MLB_MIEN_ISOC_BUFO_Pos)            /* (MLB_MIEN) Isochronous Rx buffer overflow enable Mask */
#define MLB_MIEN_ISOC_BUFO(value)             (MLB_MIEN_ISOC_BUFO_Msk & (_UINT32_(value) << MLB_MIEN_ISOC_BUFO_Pos)) /* Assigment of value for ISOC_BUFO in the MLB_MIEN register */
#define MLB_MIEN_SYNC_PE_Pos                  _UINT32_(16)                                         /* (MLB_MIEN) Synchronous protocol error enable Position */
#define MLB_MIEN_SYNC_PE_Msk                  (_UINT32_(0x1) << MLB_MIEN_SYNC_PE_Pos)              /* (MLB_MIEN) Synchronous protocol error enable Mask */
#define MLB_MIEN_SYNC_PE(value)               (MLB_MIEN_SYNC_PE_Msk & (_UINT32_(value) << MLB_MIEN_SYNC_PE_Pos)) /* Assigment of value for SYNC_PE in the MLB_MIEN register */
#define MLB_MIEN_ARX_DONE_Pos                 _UINT32_(17)                                         /* (MLB_MIEN) Asynchronous Rx packet done enable Position */
#define MLB_MIEN_ARX_DONE_Msk                 (_UINT32_(0x1) << MLB_MIEN_ARX_DONE_Pos)             /* (MLB_MIEN) Asynchronous Rx packet done enable Mask */
#define MLB_MIEN_ARX_DONE(value)              (MLB_MIEN_ARX_DONE_Msk & (_UINT32_(value) << MLB_MIEN_ARX_DONE_Pos)) /* Assigment of value for ARX_DONE in the MLB_MIEN register */
#define MLB_MIEN_ARX_PE_Pos                   _UINT32_(18)                                         /* (MLB_MIEN) Asynchronous Rx protocol error enable Position */
#define MLB_MIEN_ARX_PE_Msk                   (_UINT32_(0x1) << MLB_MIEN_ARX_PE_Pos)               /* (MLB_MIEN) Asynchronous Rx protocol error enable Mask */
#define MLB_MIEN_ARX_PE(value)                (MLB_MIEN_ARX_PE_Msk & (_UINT32_(value) << MLB_MIEN_ARX_PE_Pos)) /* Assigment of value for ARX_PE in the MLB_MIEN register */
#define MLB_MIEN_ARX_BREAK_Pos                _UINT32_(19)                                         /* (MLB_MIEN) Asynchronous Rx break enable Position */
#define MLB_MIEN_ARX_BREAK_Msk                (_UINT32_(0x1) << MLB_MIEN_ARX_BREAK_Pos)            /* (MLB_MIEN) Asynchronous Rx break enable Mask */
#define MLB_MIEN_ARX_BREAK(value)             (MLB_MIEN_ARX_BREAK_Msk & (_UINT32_(value) << MLB_MIEN_ARX_BREAK_Pos)) /* Assigment of value for ARX_BREAK in the MLB_MIEN register */
#define MLB_MIEN_ATX_DONE_Pos                 _UINT32_(20)                                         /* (MLB_MIEN) Asynchronous Tx packet done enable Position */
#define MLB_MIEN_ATX_DONE_Msk                 (_UINT32_(0x1) << MLB_MIEN_ATX_DONE_Pos)             /* (MLB_MIEN) Asynchronous Tx packet done enable Mask */
#define MLB_MIEN_ATX_DONE(value)              (MLB_MIEN_ATX_DONE_Msk & (_UINT32_(value) << MLB_MIEN_ATX_DONE_Pos)) /* Assigment of value for ATX_DONE in the MLB_MIEN register */
#define MLB_MIEN_ATX_PE_Pos                   _UINT32_(21)                                         /* (MLB_MIEN) Asynchronous Tx protocol error enable Position */
#define MLB_MIEN_ATX_PE_Msk                   (_UINT32_(0x1) << MLB_MIEN_ATX_PE_Pos)               /* (MLB_MIEN) Asynchronous Tx protocol error enable Mask */
#define MLB_MIEN_ATX_PE(value)                (MLB_MIEN_ATX_PE_Msk & (_UINT32_(value) << MLB_MIEN_ATX_PE_Pos)) /* Assigment of value for ATX_PE in the MLB_MIEN register */
#define MLB_MIEN_ATX_BREAK_Pos                _UINT32_(22)                                         /* (MLB_MIEN) Asynchronous Tx break enable Position */
#define MLB_MIEN_ATX_BREAK_Msk                (_UINT32_(0x1) << MLB_MIEN_ATX_BREAK_Pos)            /* (MLB_MIEN) Asynchronous Tx break enable Mask */
#define MLB_MIEN_ATX_BREAK(value)             (MLB_MIEN_ATX_BREAK_Msk & (_UINT32_(value) << MLB_MIEN_ATX_BREAK_Pos)) /* Assigment of value for ATX_BREAK in the MLB_MIEN register */
#define MLB_MIEN_CRX_DONE_Pos                 _UINT32_(24)                                         /* (MLB_MIEN) Control Rx packet done enable Position */
#define MLB_MIEN_CRX_DONE_Msk                 (_UINT32_(0x1) << MLB_MIEN_CRX_DONE_Pos)             /* (MLB_MIEN) Control Rx packet done enable Mask */
#define MLB_MIEN_CRX_DONE(value)              (MLB_MIEN_CRX_DONE_Msk & (_UINT32_(value) << MLB_MIEN_CRX_DONE_Pos)) /* Assigment of value for CRX_DONE in the MLB_MIEN register */
#define MLB_MIEN_CRX_PE_Pos                   _UINT32_(25)                                         /* (MLB_MIEN) Control Rx protocol error enable Position */
#define MLB_MIEN_CRX_PE_Msk                   (_UINT32_(0x1) << MLB_MIEN_CRX_PE_Pos)               /* (MLB_MIEN) Control Rx protocol error enable Mask */
#define MLB_MIEN_CRX_PE(value)                (MLB_MIEN_CRX_PE_Msk & (_UINT32_(value) << MLB_MIEN_CRX_PE_Pos)) /* Assigment of value for CRX_PE in the MLB_MIEN register */
#define MLB_MIEN_CRX_BREAK_Pos                _UINT32_(26)                                         /* (MLB_MIEN) Control Rx break enable Position */
#define MLB_MIEN_CRX_BREAK_Msk                (_UINT32_(0x1) << MLB_MIEN_CRX_BREAK_Pos)            /* (MLB_MIEN) Control Rx break enable Mask */
#define MLB_MIEN_CRX_BREAK(value)             (MLB_MIEN_CRX_BREAK_Msk & (_UINT32_(value) << MLB_MIEN_CRX_BREAK_Pos)) /* Assigment of value for CRX_BREAK in the MLB_MIEN register */
#define MLB_MIEN_CTX_DONE_Pos                 _UINT32_(27)                                         /* (MLB_MIEN) Control Tx packet done enable Position */
#define MLB_MIEN_CTX_DONE_Msk                 (_UINT32_(0x1) << MLB_MIEN_CTX_DONE_Pos)             /* (MLB_MIEN) Control Tx packet done enable Mask */
#define MLB_MIEN_CTX_DONE(value)              (MLB_MIEN_CTX_DONE_Msk & (_UINT32_(value) << MLB_MIEN_CTX_DONE_Pos)) /* Assigment of value for CTX_DONE in the MLB_MIEN register */
#define MLB_MIEN_CTX_PE_Pos                   _UINT32_(28)                                         /* (MLB_MIEN) Control Tx protocol error enable Position */
#define MLB_MIEN_CTX_PE_Msk                   (_UINT32_(0x1) << MLB_MIEN_CTX_PE_Pos)               /* (MLB_MIEN) Control Tx protocol error enable Mask */
#define MLB_MIEN_CTX_PE(value)                (MLB_MIEN_CTX_PE_Msk & (_UINT32_(value) << MLB_MIEN_CTX_PE_Pos)) /* Assigment of value for CTX_PE in the MLB_MIEN register */
#define MLB_MIEN_CTX_BREAK_Pos                _UINT32_(29)                                         /* (MLB_MIEN) Control Tx break enable Position */
#define MLB_MIEN_CTX_BREAK_Msk                (_UINT32_(0x1) << MLB_MIEN_CTX_BREAK_Pos)            /* (MLB_MIEN) Control Tx break enable Mask */
#define MLB_MIEN_CTX_BREAK(value)             (MLB_MIEN_CTX_BREAK_Msk & (_UINT32_(value) << MLB_MIEN_CTX_BREAK_Pos)) /* Assigment of value for CTX_BREAK in the MLB_MIEN register */
#define MLB_MIEN_Msk                          _UINT32_(0x3F7F0003)                                 /* (MLB_MIEN) Register Mask  */


/* -------- MLB_MLBC1 : (MLB Offset: 0x43C) (R/W 32) MediaLB Control 1 Register -------- */
#define MLB_MLBC1_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_MLBC1) MediaLB Control 1 Register  Reset Value */

#define MLB_MLBC1_LOCK_Pos                    _UINT32_(6)                                          /* (MLB_MLBC1) MediaLB lock error status Position */
#define MLB_MLBC1_LOCK_Msk                    (_UINT32_(0x1) << MLB_MLBC1_LOCK_Pos)                /* (MLB_MLBC1) MediaLB lock error status Mask */
#define MLB_MLBC1_LOCK(value)                 (MLB_MLBC1_LOCK_Msk & (_UINT32_(value) << MLB_MLBC1_LOCK_Pos)) /* Assigment of value for LOCK in the MLB_MLBC1 register */
#define MLB_MLBC1_CLKM_Pos                    _UINT32_(7)                                          /* (MLB_MLBC1) MediaLB clock missing status Position */
#define MLB_MLBC1_CLKM_Msk                    (_UINT32_(0x1) << MLB_MLBC1_CLKM_Pos)                /* (MLB_MLBC1) MediaLB clock missing status Mask */
#define MLB_MLBC1_CLKM(value)                 (MLB_MLBC1_CLKM_Msk & (_UINT32_(value) << MLB_MLBC1_CLKM_Pos)) /* Assigment of value for CLKM in the MLB_MLBC1 register */
#define MLB_MLBC1_NDA_Pos                     _UINT32_(8)                                          /* (MLB_MLBC1) Node device address Position */
#define MLB_MLBC1_NDA_Msk                     (_UINT32_(0xFF) << MLB_MLBC1_NDA_Pos)                /* (MLB_MLBC1) Node device address Mask */
#define MLB_MLBC1_NDA(value)                  (MLB_MLBC1_NDA_Msk & (_UINT32_(value) << MLB_MLBC1_NDA_Pos)) /* Assigment of value for NDA in the MLB_MLBC1 register */
#define MLB_MLBC1_Msk                         _UINT32_(0x0000FFC0)                                 /* (MLB_MLBC1) Register Mask  */


/* -------- MLB_HCTL : (MLB Offset: 0x480) (R/W 32) HBI Control Register -------- */
#define MLB_HCTL_RESETVALUE                   _UINT32_(0x00)                                       /*  (MLB_HCTL) HBI Control Register  Reset Value */

#define MLB_HCTL_RST0_Pos                     _UINT32_(0)                                          /* (MLB_HCTL) AGU0 software reset: 1 = reset active, 0 = reset inactive Position */
#define MLB_HCTL_RST0_Msk                     (_UINT32_(0x1) << MLB_HCTL_RST0_Pos)                 /* (MLB_HCTL) AGU0 software reset: 1 = reset active, 0 = reset inactive Mask */
#define MLB_HCTL_RST0(value)                  (MLB_HCTL_RST0_Msk & (_UINT32_(value) << MLB_HCTL_RST0_Pos)) /* Assigment of value for RST0 in the MLB_HCTL register */
#define MLB_HCTL_RST1_Pos                     _UINT32_(1)                                          /* (MLB_HCTL) AGU1 software reset: 1 = reset active, 0 = reset inactive Position */
#define MLB_HCTL_RST1_Msk                     (_UINT32_(0x1) << MLB_HCTL_RST1_Pos)                 /* (MLB_HCTL) AGU1 software reset: 1 = reset active, 0 = reset inactive Mask */
#define MLB_HCTL_RST1(value)                  (MLB_HCTL_RST1_Msk & (_UINT32_(value) << MLB_HCTL_RST1_Pos)) /* Assigment of value for RST1 in the MLB_HCTL register */
#define MLB_HCTL_EN_Pos                       _UINT32_(15)                                         /* (MLB_HCTL) HBI enable: 1 = enabled, 0 = disabled Position */
#define MLB_HCTL_EN_Msk                       (_UINT32_(0x1) << MLB_HCTL_EN_Pos)                   /* (MLB_HCTL) HBI enable: 1 = enabled, 0 = disabled Mask */
#define MLB_HCTL_EN(value)                    (MLB_HCTL_EN_Msk & (_UINT32_(value) << MLB_HCTL_EN_Pos)) /* Assigment of value for EN in the MLB_HCTL register */
#define MLB_HCTL_Msk                          _UINT32_(0x00008003)                                 /* (MLB_HCTL) Register Mask  */

#define MLB_HCTL_RST_Pos                      _UINT32_(0)                                          /* (MLB_HCTL Position) AGUx software reset: x = reset active, x = reset inactive */
#define MLB_HCTL_RST_Msk                      (_UINT32_(0x3) << MLB_HCTL_RST_Pos)                  /* (MLB_HCTL Mask) RST */
#define MLB_HCTL_RST(value)                   (MLB_HCTL_RST_Msk & (_UINT32_(value) << MLB_HCTL_RST_Pos)) 

