Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/mlb.h
/* -------- MLB_HCMR0 : (MLB Offset: 0x488) (R/W 32) HBI Channel Mask 0 Register -------- */
#define MLB_HCMR0_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_HCMR0) HBI Channel Mask 0 Register  Reset Value */

#define MLB_HCMR0_CHM_Pos                     _UINT32_(0)                                          /* (MLB_HCMR0) Bitwise channel mask bit: 0 = masked, 1 = unmasked Position */
#define MLB_HCMR0_CHM_Msk                     (_UINT32_(0xFFFFFFFF) << MLB_HCMR0_CHM_Pos)          /* (MLB_HCMR0) Bitwise channel mask bit: 0 = masked, 1 = unmasked Mask */
#define MLB_HCMR0_CHM(value)                  (MLB_HCMR0_CHM_Msk & (_UINT32_(value) << MLB_HCMR0_CHM_Pos)) /* Assigment of value for CHM in the MLB_HCMR0 register */
#define MLB_HCMR0_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MLB_HCMR0) Register Mask  */


/* -------- MLB_HCMR1 : (MLB Offset: 0x48C) (R/W 32) HBI Channel Mask 1 Register -------- */
#define MLB_HCMR1_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_HCMR1) HBI Channel Mask 1 Register  Reset Value */

#define MLB_HCMR1_CHM_Pos                     _UINT32_(0)                                          /* (MLB_HCMR1) Bitwise channel mask bit: 0 = masked, 1 = unmasked Position */
#define MLB_HCMR1_CHM_Msk                     (_UINT32_(0xFFFFFFFF) << MLB_HCMR1_CHM_Pos)          /* (MLB_HCMR1) Bitwise channel mask bit: 0 = masked, 1 = unmasked Mask */
#define MLB_HCMR1_CHM(value)                  (MLB_HCMR1_CHM_Msk & (_UINT32_(value) << MLB_HCMR1_CHM_Pos)) /* Assigment of value for CHM in the MLB_HCMR1 register */
#define MLB_HCMR1_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MLB_HCMR1) Register Mask  */


/* -------- MLB_HCER0 : (MLB Offset: 0x490) (R/W 32) HBI Channel Error 0 Register -------- */
#define MLB_HCER0_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_HCER0) HBI Channel Error 0 Register  Reset Value */

#define MLB_HCER0_CERR_Pos                    _UINT32_(0)                                          /* (MLB_HCER0) Bitwise channel error bit Position */
#define MLB_HCER0_CERR_Msk                    (_UINT32_(0xFFFFFFFF) << MLB_HCER0_CERR_Pos)         /* (MLB_HCER0) Bitwise channel error bit Mask */
#define MLB_HCER0_CERR(value)                 (MLB_HCER0_CERR_Msk & (_UINT32_(value) << MLB_HCER0_CERR_Pos)) /* Assigment of value for CERR in the MLB_HCER0 register */
#define MLB_HCER0_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MLB_HCER0) Register Mask  */


/* -------- MLB_HCER1 : (MLB Offset: 0x494) (R/W 32) HBI Channel Error 1 Register -------- */
#define MLB_HCER1_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_HCER1) HBI Channel Error 1 Register  Reset Value */

#define MLB_HCER1_CERR_Pos                    _UINT32_(0)                                          /* (MLB_HCER1) Bitwise channel error bit Position */
#define MLB_HCER1_CERR_Msk                    (_UINT32_(0xFFFFFFFF) << MLB_HCER1_CERR_Pos)         /* (MLB_HCER1) Bitwise channel error bit Mask */
#define MLB_HCER1_CERR(value)                 (MLB_HCER1_CERR_Msk & (_UINT32_(value) << MLB_HCER1_CERR_Pos)) /* Assigment of value for CERR in the MLB_HCER1 register */
#define MLB_HCER1_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MLB_HCER1) Register Mask  */


/* -------- MLB_HCBR0 : (MLB Offset: 0x498) ( R/ 32) HBI Channel Busy 0 Register -------- */
#define MLB_HCBR0_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_HCBR0) HBI Channel Busy 0 Register  Reset Value */

#define MLB_HCBR0_CHB_Pos                     _UINT32_(0)                                          /* (MLB_HCBR0) Bitwise channel busy bit: 0 = idle, 1 = busy Position */
#define MLB_HCBR0_CHB_Msk                     (_UINT32_(0xFFFFFFFF) << MLB_HCBR0_CHB_Pos)          /* (MLB_HCBR0) Bitwise channel busy bit: 0 = idle, 1 = busy Mask */
#define MLB_HCBR0_CHB(value)                  (MLB_HCBR0_CHB_Msk & (_UINT32_(value) << MLB_HCBR0_CHB_Pos)) /* Assigment of value for CHB in the MLB_HCBR0 register */
#define MLB_HCBR0_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MLB_HCBR0) Register Mask  */


/* -------- MLB_HCBR1 : (MLB Offset: 0x49C) ( R/ 32) HBI Channel Busy 1 Register -------- */
#define MLB_HCBR1_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_HCBR1) HBI Channel Busy 1 Register  Reset Value */

#define MLB_HCBR1_CHB_Pos                     _UINT32_(0)                                          /* (MLB_HCBR1) Bitwise channel busy bit: 0 = idle, 1 = busy Position */
#define MLB_HCBR1_CHB_Msk                     (_UINT32_(0xFFFFFFFF) << MLB_HCBR1_CHB_Pos)          /* (MLB_HCBR1) Bitwise channel busy bit: 0 = idle, 1 = busy Mask */
#define MLB_HCBR1_CHB(value)                  (MLB_HCBR1_CHB_Msk & (_UINT32_(value) << MLB_HCBR1_CHB_Pos)) /* Assigment of value for CHB in the MLB_HCBR1 register */
#define MLB_HCBR1_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MLB_HCBR1) Register Mask  */


/* -------- MLB_MDAT0 : (MLB Offset: 0x4C0) (R/W 32) MIF Data 0 Register -------- */
#define MLB_MDAT0_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_MDAT0) MIF Data 0 Register  Reset Value */

#define MLB_MDAT0_DATA_Pos                    _UINT32_(0)                                          /* (MLB_MDAT0) CTR data - bits[31:0] of 128-bit entry or DBR data - bits[7:0] of 8-bit entry Position */
#define MLB_MDAT0_DATA_Msk                    (_UINT32_(0xFFFFFFFF) << MLB_MDAT0_DATA_Pos)         /* (MLB_MDAT0) CTR data - bits[31:0] of 128-bit entry or DBR data - bits[7:0] of 8-bit entry Mask */
#define MLB_MDAT0_DATA(value)                 (MLB_MDAT0_DATA_Msk & (_UINT32_(value) << MLB_MDAT0_DATA_Pos)) /* Assigment of value for DATA in the MLB_MDAT0 register */
#define MLB_MDAT0_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MLB_MDAT0) Register Mask  */


/* -------- MLB_MDAT1 : (MLB Offset: 0x4C4) (R/W 32) MIF Data 1 Register -------- */
#define MLB_MDAT1_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_MDAT1) MIF Data 1 Register  Reset Value */

#define MLB_MDAT1_DATA_Pos                    _UINT32_(0)                                          /* (MLB_MDAT1) CTR data - bits[63:32] of 128-bit entry Position */
#define MLB_MDAT1_DATA_Msk                    (_UINT32_(0xFFFFFFFF) << MLB_MDAT1_DATA_Pos)         /* (MLB_MDAT1) CTR data - bits[63:32] of 128-bit entry Mask */
#define MLB_MDAT1_DATA(value)                 (MLB_MDAT1_DATA_Msk & (_UINT32_(value) << MLB_MDAT1_DATA_Pos)) /* Assigment of value for DATA in the MLB_MDAT1 register */
#define MLB_MDAT1_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MLB_MDAT1) Register Mask  */


/* -------- MLB_MDAT2 : (MLB Offset: 0x4C8) (R/W 32) MIF Data 2 Register -------- */
#define MLB_MDAT2_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_MDAT2) MIF Data 2 Register  Reset Value */

#define MLB_MDAT2_DATA_Pos                    _UINT32_(0)                                          /* (MLB_MDAT2) CTR data - bits[95:64] of 128-bit entry Position */
#define MLB_MDAT2_DATA_Msk                    (_UINT32_(0xFFFFFFFF) << MLB_MDAT2_DATA_Pos)         /* (MLB_MDAT2) CTR data - bits[95:64] of 128-bit entry Mask */
#define MLB_MDAT2_DATA(value)                 (MLB_MDAT2_DATA_Msk & (_UINT32_(value) << MLB_MDAT2_DATA_Pos)) /* Assigment of value for DATA in the MLB_MDAT2 register */
#define MLB_MDAT2_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MLB_MDAT2) Register Mask  */


