Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/mlb.h
#define MLB_ACSR1_CHS_Pos                     _UINT32_(0)                                          /* (MLB_ACSR1) Interrupt status for logical channels 63 to 32: 0 = None 1 = Interrupt Position */
#define MLB_ACSR1_CHS_Msk                     (_UINT32_(0xFFFFFFFF) << MLB_ACSR1_CHS_Pos)          /* (MLB_ACSR1) Interrupt status for logical channels 63 to 32: 0 = None 1 = Interrupt Mask */
#define MLB_ACSR1_CHS(value)                  (MLB_ACSR1_CHS_Msk & (_UINT32_(value) << MLB_ACSR1_CHS_Pos)) /* Assigment of value for CHS in the MLB_ACSR1 register */
#define MLB_ACSR1_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MLB_ACSR1) Register Mask  */


/* -------- MLB_ACMR0 : (MLB Offset: 0x7D8) (R/W 32) AHB Channel Mask 0 Register -------- */
#define MLB_ACMR0_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_ACMR0) AHB Channel Mask 0 Register  Reset Value */

#define MLB_ACMR0_CHM_Pos                     _UINT32_(0)                                          /* (MLB_ACMR0) Bitwise channel mask bit:0 = Masked 1 = Unmasked Position */
#define MLB_ACMR0_CHM_Msk                     (_UINT32_(0xFFFFFFFF) << MLB_ACMR0_CHM_Pos)          /* (MLB_ACMR0) Bitwise channel mask bit:0 = Masked 1 = Unmasked Mask */
#define MLB_ACMR0_CHM(value)                  (MLB_ACMR0_CHM_Msk & (_UINT32_(value) << MLB_ACMR0_CHM_Pos)) /* Assigment of value for CHM in the MLB_ACMR0 register */
#define MLB_ACMR0_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MLB_ACMR0) Register Mask  */


/* -------- MLB_ACMR1 : (MLB Offset: 0x7DC) (R/W 32) AHB Channel Mask 1 Register -------- */
#define MLB_ACMR1_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_ACMR1) AHB Channel Mask 1 Register  Reset Value */

#define MLB_ACMR1_CHM_Pos                     _UINT32_(0)                                          /* (MLB_ACMR1) Bitwise channel mask bit:0 = Masked 1 = Unmasked Position */
#define MLB_ACMR1_CHM_Msk                     (_UINT32_(0xFFFFFFFF) << MLB_ACMR1_CHM_Pos)          /* (MLB_ACMR1) Bitwise channel mask bit:0 = Masked 1 = Unmasked Mask */
#define MLB_ACMR1_CHM(value)                  (MLB_ACMR1_CHM_Msk & (_UINT32_(value) << MLB_ACMR1_CHM_Pos)) /* Assigment of value for CHM in the MLB_ACMR1 register */
#define MLB_ACMR1_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MLB_ACMR1) Register Mask  */


/** \brief MLB register offsets definitions */
#define MLB_CTRLA_REG_OFST             _UINT32_(0x00)      /* (MLB_CTRLA) MLB Wrapper Control Register Offset */
#define MLB_INTENCLR_REG_OFST          _UINT32_(0x10)      /* (MLB_INTENCLR) Interrupt Enable Clear Register Offset */
#define MLB_INTENSET_REG_OFST          _UINT32_(0x14)      /* (MLB_INTENSET) Interrupt Enable Set Register Offset */
#define MLB_INTFLAG_REG_OFST           _UINT32_(0x18)      /* (MLB_INTFLAG) Interrupt Status and Clear Register Offset */
#define MLB_DBGCTRL_REG_OFST           _UINT32_(0x1C)      /* (MLB_DBGCTRL) Debug Control Register Offset */
#define MLB_SYNCBUSY_REG_OFST          _UINT32_(0x20)      /* (MLB_SYNCBUSY) SYNCBUSY Register Offset */
#define MLB_MLBC0_REG_OFST             _UINT32_(0x400)     /* (MLB_MLBC0) MediaLB Control 0 Register Offset */
#define MLB_MS0_REG_OFST               _UINT32_(0x40C)     /* (MLB_MS0) MediaLB Channel Status 0 Register Offset */
#define MLB_MS1_REG_OFST               _UINT32_(0x414)     /* (MLB_MS1) MediaLB Channel Status 1 Register Offset */
#define MLB_MSS_REG_OFST               _UINT32_(0x420)     /* (MLB_MSS) MediaLB System Status Register Offset */
#define MLB_MSD_REG_OFST               _UINT32_(0x424)     /* (MLB_MSD) MediaLB System Data Register (Read-only) Offset */
#define MLB_MIEN_REG_OFST              _UINT32_(0x42C)     /* (MLB_MIEN) MediaLB Interrupt Enable Register Offset */
#define MLB_MLBC1_REG_OFST             _UINT32_(0x43C)     /* (MLB_MLBC1) MediaLB Control 1 Register Offset */
#define MLB_HCTL_REG_OFST              _UINT32_(0x480)     /* (MLB_HCTL) HBI Control Register Offset */
#define MLB_HCMR0_REG_OFST             _UINT32_(0x488)     /* (MLB_HCMR0) HBI Channel Mask 0 Register Offset */
#define MLB_HCMR1_REG_OFST             _UINT32_(0x48C)     /* (MLB_HCMR1) HBI Channel Mask 1 Register Offset */
#define MLB_HCER0_REG_OFST             _UINT32_(0x490)     /* (MLB_HCER0) HBI Channel Error 0 Register Offset */
#define MLB_HCER1_REG_OFST             _UINT32_(0x494)     /* (MLB_HCER1) HBI Channel Error 1 Register Offset */
#define MLB_HCBR0_REG_OFST             _UINT32_(0x498)     /* (MLB_HCBR0) HBI Channel Busy 0 Register Offset */
#define MLB_HCBR1_REG_OFST             _UINT32_(0x49C)     /* (MLB_HCBR1) HBI Channel Busy 1 Register Offset */
#define MLB_MDAT0_REG_OFST             _UINT32_(0x4C0)     /* (MLB_MDAT0) MIF Data 0 Register Offset */
#define MLB_MDAT1_REG_OFST             _UINT32_(0x4C4)     /* (MLB_MDAT1) MIF Data 1 Register Offset */
#define MLB_MDAT2_REG_OFST             _UINT32_(0x4C8)     /* (MLB_MDAT2) MIF Data 2 Register Offset */
#define MLB_MDAT3_REG_OFST             _UINT32_(0x4CC)     /* (MLB_MDAT3) MIF Data 3 Register Offset */
#define MLB_MDWE0_REG_OFST             _UINT32_(0x4D0)     /* (MLB_MDWE0) MIF Data Write Enable 0 Register Offset */
#define MLB_MDWE1_REG_OFST             _UINT32_(0x4D4)     /* (MLB_MDWE1) MIF Data Write Enable 1 Register Offset */
#define MLB_MDWE2_REG_OFST             _UINT32_(0x4D8)     /* (MLB_MDWE2) MIF Data Write Enable 2 Register Offset */
#define MLB_MDWE3_REG_OFST             _UINT32_(0x4DC)     /* (MLB_MDWE3) MIF Data Write Enable 3 Register Offset */
#define MLB_MCTL_REG_OFST              _UINT32_(0x4E0)     /* (MLB_MCTL) MIF Control Register Offset */
#define MLB_MADR_REG_OFST              _UINT32_(0x4E4)     /* (MLB_MADR) MIF Address Register Offset */
#define MLB_ACTL_REG_OFST              _UINT32_(0x7C0)     /* (MLB_ACTL) AHB Control Register Offset */
#define MLB_ACSR0_REG_OFST             _UINT32_(0x7D0)     /* (MLB_ACSR0) AHB Channel Status 0 Register Offset */
#define MLB_ACSR1_REG_OFST             _UINT32_(0x7D4)     /* (MLB_ACSR1) AHB Channel Status 1 Register Offset */
#define MLB_ACMR0_REG_OFST             _UINT32_(0x7D8)     /* (MLB_ACMR0) AHB Channel Mask 0 Register Offset */
#define MLB_ACMR1_REG_OFST             _UINT32_(0x7DC)     /* (MLB_ACMR1) AHB Channel Mask 1 Register Offset */

